
&НаКлиенте
Процедура Поступление(Команда)
	
	ЭлементыОтбора = Новый Структура("СчетКасса",ПолучитьСчет());
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы)
	
КонецПроцедуры

&НаКлиенте
Процедура Выдача(Команда)
	
	ЭлементыОтбора = Новый Структура("СчетКасса",ПолучитьСчет());
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЭлементыОтбора);
	ОткрытьФорму("Документ.РасходныйКассовыйОрдер.ФормаОбъекта", ПараметрыФормы)
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСчет()  //50.02
	
	Возврат ПланыСчетов.Хозрасчетный.ОперационнаяКасса;
	
КонецФункции